app/views/clasifications/index.html.erb

SELECT DISTINCT COUNT(*) FROM "clasifications"
---
  <%= link_to '<i class="icon-plus"></i>'.html_safe + t(:new, :default => "New") + ' ' + t(:clasification, :default => "clasification"), new_clasification_path, :class => "btn" %>
  <% if Clasification.columns.map(&:name).include?("clasification_id") then %>