app/views/calendars/index.html.erb

SELECT DISTINCT COUNT(*) FROM "calendars"
---
  <%= link_to '<i class="icon-plus"></i>'.html_safe + t(:new, :default => "New") + ' ' + t(:calendar, :default => "calendar"), new_calendar_path, :class => "btn" %>
  <% if Calendar.columns.map(&:name).include?("calendar_id") then %>