app/controllers/calendars_controller.rb

  def create
    @calendar = Calendar.create(params[:calendar])
---
INSERT INTO "calendars" ("categoria", "competicion", "created_at", "fecha", "hora", "isla", "jornada", "local", "resultadolocal", "resultadovisitante", "sanciones", "updated_at", "visitante") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def batch
    attr_or_method, value = params[:actionprocess].split(".")

    @calendars = []

    Calendar.transaction do
      if params[:checkallelt] == "all" then
        # Selected with filter and search
        do_sort_and_paginate(:calendar)

        @calendars = Calendar.search(
          params[:q]
        ).result(
          :distinct => true
        )
      else
        # Selected elements
        @calendars = Calendar.find(params[:ids].to_a)
      end

      @calendars.each{ |calendar|
        if not Calendar.columns_hash[attr_or_method].nil? and
               Calendar.columns_hash[attr_or_method].type == :boolean then
         calendar.update_attribute(attr_or_method, boolean(value))
         calendar.save
        else
          case attr_or_method
          # Set here your own batch processing
          # calendar.save
          when "destroy" then
            calendar.destroy
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" IN (2, 1)
DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 1]]

  def demo
    @calendar = Calendar.all
---
SELECT "calendars".* FROM "calendars"

  def getallcalendars
    if(params[:competicion] != nil && params[:isla] != nil && params[:categoria] != nil && params[:jornada] != nil )
        @result = Calendar.where :competicion => params[:competicion], :isla => params[:isla], :categoria => params[:categoria], :jornada => params[:jornada]
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."competicion" = 'Liga' AND "calendars"."isla" = 'Tenerife' AND "calendars"."categoria" = '1A' AND "calendars"."jornada" = '1'

  def load_calendar
    @calendar = Calendar.find(params[:id])
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", "2"]]