app/controllers/clasifications_controller.rb

  def create
    @clasification = Clasification.create(params[:clasification])
---
INSERT INTO "clasifications" ("categoria", "competicion", "created_at", "empatadas", "equipo", "ganadas", "isla", "luchasafavor", "luchasencontra", "luchastotales", "perdidas", "puntos", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def getclasification
    if(params[:competicion] != nil && params[:isla] != nil && params[:categoria] != nil )
        @result = Clasification.where :competicion => params[:competicion], :isla => params[:isla], :categoria => params[:categoria]
---
SELECT "clasifications".* FROM "clasifications" WHERE "clasifications"."competicion" = 'Liga' AND "clasifications"."isla" = 'Tenerife' AND "clasifications"."categoria" = '1A'

  def load_clasification
    @clasification = Clasification.find(params[:id])
---
SELECT "clasifications".* FROM "clasifications" WHERE "clasifications"."id" = ? LIMIT 1  [["id", "1"]]